esp32-open-mac/qemu/include/hw/dma/esp32c3_gdma.h
/*
 * ESP32-C3 GDMA emulation
 *
 * Copyright (c) 2023 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#pragma once

#include "hw/hw.h"
#include "hw/sysbus.h"
#include "hw/registerfields.h"
#include "hw/misc/esp32c3_reg.h"

#define TYPE_ESP32C3_GDMA "esp32c3.gdma"
#define ESP32C3_GDMA(obj) OBJECT_CHECK(ESP32C3GdmaState, (obj), TYPE_ESP32C3_GDMA)

#define ESP32C3_GDMA_REGS_SIZE (A_DMA_OUT_PERI_SEL_CH2 + 4)

#define ESP32C3_GDMA_CHANNEL_COUNT 3

#define ESP32C3_GDMA_IN_IDX     0
#define ESP32C3_GDMA_OUT_IDX    1
#define ESP32C3_GDMA_CONF_COUNT (ESP32C3_GDMA_OUT_IDX + 1)

#define ESP32C3_GDMA_RAM_ADDR   0x3FC80000


/**
 * @brief Number for each peripheral that can access GDMA
 */
typedef enum {
    GDMA_SPI2  = 0,
    GDMA_RSVD1 = 1,
    GDMA_UHCI0 = 2,
    GDMA_I2S   = 3,
    GDMA_RSVD4 = 4,
    GDMA_RSVD5 = 5,
    GDMA_AES   = 6,
    GDMA_SHA   = 7,
    GDMA_ADC   = 8,
    GDMA_LAST  = GDMA_ADC,
} GdmaPeripheral;


/**
 * Size of the interrupt registers, in bytes, for a single channel
 */
#define ESP32C3_GDMA_INT_REGS_SIZE  0x10

typedef struct {
    uint32_t raw;
    uint32_t st;
    uint32_t ena;
    /* Not really necessary to have this variable here as it will never contain
    * any data, but will simplify the code (offset calculation) */
    uint32_t clr;
} DmaIntState;


typedef struct {
    uint32_t conf0;
    uint32_t conf1;
    uint32_t status;
    uint32_t push_pop;
    uint32_t link;
    /* Status registers */
    uint32_t state;
    uint32_t suc_eof_desc_addr; // Address of descriptor when EOF bit is 1
    uint32_t err_eof_desc_addr; // Address of descriptor when error occurs (UHCI0 only)
    uint32_t desc_addr; // Address of the next descriptor (n + 1)
    uint32_t bfr_desc_addr; // Address of the current descriptor (n)
    uint32_t bfr_bfr_desc_addr; // Address of the previous descriptor (n - 1)
    uint32_t priority;
    uint32_t peripheral;
} DmaConfigState;


typedef struct ESP32C3GdmaState {
    SysBusDevice parent_object;
    MemoryRegion iomem;
    qemu_irq irq[ESP32C3_GDMA_CHANNEL_COUNT];

    DmaIntState ch_int[ESP32C3_GDMA_CHANNEL_COUNT];
    DmaConfigState ch_conf[ESP32C3_GDMA_CHANNEL_COUNT][ESP32C3_GDMA_CONF_COUNT];

    /* Use this register mainly for enabling and disabling priorities */
    uint32_t misc_conf;

    /* Keep a pointer to the SoC DRAM */
    MemoryRegion* soc_mr;
    AddressSpace dma_as;

} ESP32C3GdmaState;


/**
 * @brief Get the channel configured for the given peripheral
 *
 * @param s GDMA state
 * @param periph Peripheral to search
 * @param dir Direction: ESP32C3_GDMA_IN_IDX or ESP32C3_GDMA_OUT_IDX
 *
 * @returns index of the GDMA channel bound to the peripheral, -1 if not found
 */
int esp32c3_gdma_get_channel_periph(ESP32C3GdmaState *s, GdmaPeripheral periph, int dir);


REG32(DMA_INT_RAW_CH0, 0x000)
    FIELD(DMA_INT_RAW_CH0, OUTFIFO_UDF_CH0_INT_RAW, 12, 1)
    FIELD(DMA_INT_RAW_CH0, OUTFIFO_OVF_CH0_INT_RAW, 11, 1)
    FIELD(DMA_INT_RAW_CH0, INFIFO_UDF_CH0_INT_RAW, 10, 1)
    FIELD(DMA_INT_RAW_CH0, INFIFO_OVF_CH0_INT_RAW, 9, 1)
    FIELD(DMA_INT_RAW_CH0, OUT_TOTAL_EOF_CH0_INT_RAW, 8, 1)
    FIELD(DMA_INT_RAW_CH0, IN_DSCR_EMPTY_CH0_INT_RAW, 7, 1)
    FIELD(DMA_INT_RAW_CH0, OUT_DSCR_ERR_CH0_INT_RAW, 6, 1)
    FIELD(DMA_INT_RAW_CH0, IN_DSCR_ERR_CH0_INT_RAW, 5, 1)
    FIELD(DMA_INT_RAW_CH0, OUT_EOF_CH0_INT_RAW, 4, 1)
    FIELD(DMA_INT_RAW_CH0, OUT_DONE_CH0_INT_RAW, 3, 1)
    FIELD(DMA_INT_RAW_CH0, IN_ERR_EOF_CH0_INT_RAW, 2, 1)
    FIELD(DMA_INT_RAW_CH0, IN_SUC_EOF_CH0_INT_RAW, 1, 1)
    FIELD(DMA_INT_RAW_CH0, IN_DONE_CH0_INT_RAW, 0, 1)

REG32(DMA_INT_ST_CH0, 0x004)
    FIELD(DMA_INT_ST_CH0, OUTFIFO_UDF_CH0_INT_ST, 12, 1)
    FIELD(DMA_INT_ST_CH0, OUTFIFO_OVF_CH0_INT_ST, 11, 1)
    FIELD(DMA_INT_ST_CH0, INFIFO_UDF_CH0_INT_ST, 10, 1)
    FIELD(DMA_INT_ST_CH0, INFIFO_OVF_CH0_INT_ST, 9, 1)
    FIELD(DMA_INT_ST_CH0, OUT_TOTAL_EOF_CH0_INT_ST, 8, 1)
    FIELD(DMA_INT_ST_CH0, IN_DSCR_EMPTY_CH0_INT_ST, 7, 1)
    FIELD(DMA_INT_ST_CH0, OUT_DSCR_ERR_CH0_INT_ST, 6, 1)
    FIELD(DMA_INT_ST_CH0, IN_DSCR_ERR_CH0_INT_ST, 5, 1)
    FIELD(DMA_INT_ST_CH0, OUT_EOF_CH0_INT_ST, 4, 1)
    FIELD(DMA_INT_ST_CH0, OUT_DONE_CH0_INT_ST, 3, 1)
    FIELD(DMA_INT_ST_CH0, IN_ERR_EOF_CH0_INT_ST, 2, 1)
    FIELD(DMA_INT_ST_CH0, IN_SUC_EOF_CH0_INT_ST, 1, 1)
    FIELD(DMA_INT_ST_CH0, IN_DONE_CH0_INT_ST, 0, 1)

REG32(DMA_INT_ENA_CH0, 0x008)
    FIELD(DMA_INT_ENA_CH0, OUTFIFO_UDF_CH0_INT_ENA, 12, 1)
    FIELD(DMA_INT_ENA_CH0, OUTFIFO_OVF_CH0_INT_ENA, 11, 1)
    FIELD(DMA_INT_ENA_CH0, INFIFO_UDF_CH0_INT_ENA, 10, 1)
    FIELD(DMA_INT_ENA_CH0, INFIFO_OVF_CH0_INT_ENA, 9, 1)
    FIELD(DMA_INT_ENA_CH0, OUT_TOTAL_EOF_CH0_INT_ENA, 8, 1)
    FIELD(DMA_INT_ENA_CH0, IN_DSCR_EMPTY_CH0_INT_ENA, 7, 1)
    FIELD(DMA_INT_ENA_CH0, OUT_DSCR_ERR_CH0_INT_ENA, 6, 1)
    FIELD(DMA_INT_ENA_CH0, IN_DSCR_ERR_CH0_INT_ENA, 5, 1)
    FIELD(DMA_INT_ENA_CH0, OUT_EOF_CH0_INT_ENA, 4, 1)
    FIELD(DMA_INT_ENA_CH0, OUT_DONE_CH0_INT_ENA, 3, 1)
    FIELD(DMA_INT_ENA_CH0, IN_ERR_EOF_CH0_INT_ENA, 2, 1)
    FIELD(DMA_INT_ENA_CH0, IN_SUC_EOF_CH0_INT_ENA, 1, 1)
    FIELD(DMA_INT_ENA_CH0, IN_DONE_CH0_INT_ENA, 0, 1)

REG32(DMA_INT_CLR_CH0, 0x00C)
    FIELD(DMA_INT_CLR_CH0, OUTFIFO_UDF_CH0_INT_CLR, 12, 1)
    FIELD(DMA_INT_CLR_CH0, OUTFIFO_OVF_CH0_INT_CLR, 11, 1)
    FIELD(DMA_INT_CLR_CH0, INFIFO_UDF_CH0_INT_CLR, 10, 1)
    FIELD(DMA_INT_CLR_CH0, INFIFO_OVF_CH0_INT_CLR, 9, 1)
    FIELD(DMA_INT_CLR_CH0, OUT_TOTAL_EOF_CH0_INT_CLR, 8, 1)
    FIELD(DMA_INT_CLR_CH0, IN_DSCR_EMPTY_CH0_INT_CLR, 7, 1)
    FIELD(DMA_INT_CLR_CH0, OUT_DSCR_ERR_CH0_INT_CLR, 6, 1)
    FIELD(DMA_INT_CLR_CH0, IN_DSCR_ERR_CH0_INT_CLR, 5, 1)
    FIELD(DMA_INT_CLR_CH0, OUT_EOF_CH0_INT_CLR, 4, 1)
    FIELD(DMA_INT_CLR_CH0, OUT_DONE_CH0_INT_CLR, 3, 1)
    FIELD(DMA_INT_CLR_CH0, IN_ERR_EOF_CH0_INT_CLR, 2, 1)
    FIELD(DMA_INT_CLR_CH0, IN_SUC_EOF_CH0_INT_CLR, 1, 1)
    FIELD(DMA_INT_CLR_CH0, IN_DONE_CH0_INT_CLR, 0, 1)

REG32(DMA_INT_RAW_CH1, 0x010)
    FIELD(DMA_INT_RAW_CH1, OUTFIFO_UDF_CH1_INT_RAW, 12, 1)
    FIELD(DMA_INT_RAW_CH1, OUTFIFO_OVF_CH1_INT_RAW, 11, 1)
    FIELD(DMA_INT_RAW_CH1, INFIFO_UDF_CH1_INT_RAW, 10, 1)
    FIELD(DMA_INT_RAW_CH1, INFIFO_OVF_CH1_INT_RAW, 9, 1)
    FIELD(DMA_INT_RAW_CH1, OUT_TOTAL_EOF_CH1_INT_RAW, 8, 1)
    FIELD(DMA_INT_RAW_CH1, IN_DSCR_EMPTY_CH1_INT_RAW, 7, 1)
    FIELD(DMA_INT_RAW_CH1, OUT_DSCR_ERR_CH1_INT_RAW, 6, 1)
    FIELD(DMA_INT_RAW_CH1, IN_DSCR_ERR_CH1_INT_RAW, 5, 1)
    FIELD(DMA_INT_RAW_CH1, OUT_EOF_CH1_INT_RAW, 4, 1)
    FIELD(DMA_INT_RAW_CH1, OUT_DONE_CH1_INT_RAW, 3, 1)
    FIELD(DMA_INT_RAW_CH1, IN_ERR_EOF_CH1_INT_RAW, 2, 1)
    FIELD(DMA_INT_RAW_CH1, IN_SUC_EOF_CH1_INT_RAW, 1, 1)
    FIELD(DMA_INT_RAW_CH1, IN_DONE_CH1_INT_RAW, 0, 1)

REG32(DMA_INT_ST_CH1, 0x014)
    FIELD(DMA_INT_ST_CH1, OUTFIFO_UDF_CH1_INT_ST, 12, 1)
    FIELD(DMA_INT_ST_CH1, OUTFIFO_OVF_CH1_INT_ST, 11, 1)
    FIELD(DMA_INT_ST_CH1, INFIFO_UDF_CH1_INT_ST, 10, 1)
    FIELD(DMA_INT_ST_CH1, INFIFO_OVF_CH1_INT_ST, 9, 1)
    FIELD(DMA_INT_ST_CH1, OUT_TOTAL_EOF_CH1_INT_ST, 8, 1)
    FIELD(DMA_INT_ST_CH1, IN_DSCR_EMPTY_CH1_INT_ST, 7, 1)
    FIELD(DMA_INT_ST_CH1, OUT_DSCR_ERR_CH1_INT_ST, 6, 1)
    FIELD(DMA_INT_ST_CH1, IN_DSCR_ERR_CH1_INT_ST, 5, 1)
    FIELD(DMA_INT_ST_CH1, OUT_EOF_CH1_INT_ST, 4, 1)
    FIELD(DMA_INT_ST_CH1, OUT_DONE_CH1_INT_ST, 3, 1)
    FIELD(DMA_INT_ST_CH1, IN_ERR_EOF_CH1_INT_ST, 2, 1)
    FIELD(DMA_INT_ST_CH1, IN_SUC_EOF_CH1_INT_ST, 1, 1)
    FIELD(DMA_INT_ST_CH1, IN_DONE_CH1_INT_ST, 0, 1)

REG32(DMA_INT_ENA_CH1, 0x018)
    FIELD(DMA_INT_ENA_CH1, OUTFIFO_UDF_CH1_INT_ENA, 12, 1)
    FIELD(DMA_INT_ENA_CH1, OUTFIFO_OVF_CH1_INT_ENA, 11, 1)
    FIELD(DMA_INT_ENA_CH1, INFIFO_UDF_CH1_INT_ENA, 10, 1)
    FIELD(DMA_INT_ENA_CH1, INFIFO_OVF_CH1_INT_ENA, 9, 1)
    FIELD(DMA_INT_ENA_CH1, OUT_TOTAL_EOF_CH1_INT_ENA, 8, 1)
    FIELD(DMA_INT_ENA_CH1, IN_DSCR_EMPTY_CH1_INT_ENA, 7, 1)
    FIELD(DMA_INT_ENA_CH1, OUT_DSCR_ERR_CH1_INT_ENA, 6, 1)
    FIELD(DMA_INT_ENA_CH1, IN_DSCR_ERR_CH1_INT_ENA, 5, 1)
    FIELD(DMA_INT_ENA_CH1, OUT_EOF_CH1_INT_ENA, 4, 1)
    FIELD(DMA_INT_ENA_CH1, OUT_DONE_CH1_INT_ENA, 3, 1)
    FIELD(DMA_INT_ENA_CH1, IN_ERR_EOF_CH1_INT_ENA, 2, 1)
    FIELD(DMA_INT_ENA_CH1, IN_SUC_EOF_CH1_INT_ENA, 1, 1)
    FIELD(DMA_INT_ENA_CH1, IN_DONE_CH1_INT_ENA, 0, 1)

REG32(DMA_INT_CLR_CH1, 0x01C)
    FIELD(DMA_INT_CLR_CH1, OUTFIFO_UDF_CH1_INT_CLR, 12, 1)
    FIELD(DMA_INT_CLR_CH1, OUTFIFO_OVF_CH1_INT_CLR, 11, 1)
    FIELD(DMA_INT_CLR_CH1, INFIFO_UDF_CH1_INT_CLR, 10, 1)
    FIELD(DMA_INT_CLR_CH1, INFIFO_OVF_CH1_INT_CLR, 9, 1)
    FIELD(DMA_INT_CLR_CH1, OUT_TOTAL_EOF_CH1_INT_CLR, 8, 1)
    FIELD(DMA_INT_CLR_CH1, IN_DSCR_EMPTY_CH1_INT_CLR, 7, 1)
    FIELD(DMA_INT_CLR_CH1, OUT_DSCR_ERR_CH1_INT_CLR, 6, 1)
    FIELD(DMA_INT_CLR_CH1, IN_DSCR_ERR_CH1_INT_CLR, 5, 1)
    FIELD(DMA_INT_CLR_CH1, OUT_EOF_CH1_INT_CLR, 4, 1)
    FIELD(DMA_INT_CLR_CH1, OUT_DONE_CH1_INT_CLR, 3, 1)
    FIELD(DMA_INT_CLR_CH1, IN_ERR_EOF_CH1_INT_CLR, 2, 1)
    FIELD(DMA_INT_CLR_CH1, IN_SUC_EOF_CH1_INT_CLR, 1, 1)
    FIELD(DMA_INT_CLR_CH1, IN_DONE_CH1_INT_CLR, 0, 1)

REG32(DMA_INT_RAW_CH2, 0x020)
    FIELD(DMA_INT_RAW_CH2, OUTFIFO_UDF_CH2_INT_RAW, 12, 1)
    FIELD(DMA_INT_RAW_CH2, OUTFIFO_OVF_CH2_INT_RAW, 11, 1)
    FIELD(DMA_INT_RAW_CH2, INFIFO_UDF_CH2_INT_RAW, 10, 1)
    FIELD(DMA_INT_RAW_CH2, INFIFO_OVF_CH2_INT_RAW, 9, 1)
    FIELD(DMA_INT_RAW_CH2, OUT_TOTAL_EOF_CH2_INT_RAW, 8, 1)
    FIELD(DMA_INT_RAW_CH2, IN_DSCR_EMPTY_CH2_INT_RAW, 7, 1)
    FIELD(DMA_INT_RAW_CH2, OUT_DSCR_ERR_CH2_INT_RAW, 6, 1)
    FIELD(DMA_INT_RAW_CH2, IN_DSCR_ERR_CH2_INT_RAW, 5, 1)
    FIELD(DMA_INT_RAW_CH2, OUT_EOF_CH2_INT_RAW, 4, 1)
    FIELD(DMA_INT_RAW_CH2, OUT_DONE_CH2_INT_RAW, 3, 1)
    FIELD(DMA_INT_RAW_CH2, IN_ERR_EOF_CH2_INT_RAW, 2, 1)
    FIELD(DMA_INT_RAW_CH2, IN_SUC_EOF_CH2_INT_RAW, 1, 1)
    FIELD(DMA_INT_RAW_CH2, IN_DONE_CH2_INT_RAW, 0, 1)

REG32(DMA_INT_ST_CH2, 0x024)
    FIELD(DMA_INT_ST_CH2, OUTFIFO_UDF_CH2_INT_ST, 12, 1)
    FIELD(DMA_INT_ST_CH2, OUTFIFO_OVF_CH2_INT_ST, 11, 1)
    FIELD(DMA_INT_ST_CH2, INFIFO_UDF_CH2_INT_ST, 10, 1)
    FIELD(DMA_INT_ST_CH2, INFIFO_OVF_CH2_INT_ST, 9, 1)
    FIELD(DMA_INT_ST_CH2, OUT_TOTAL_EOF_CH2_INT_ST, 8, 1)
    FIELD(DMA_INT_ST_CH2, IN_DSCR_EMPTY_CH2_INT_ST, 7, 1)
    FIELD(DMA_INT_ST_CH2, OUT_DSCR_ERR_CH2_INT_ST, 6, 1)
    FIELD(DMA_INT_ST_CH2, IN_DSCR_ERR_CH2_INT_ST, 5, 1)
    FIELD(DMA_INT_ST_CH2, OUT_EOF_CH2_INT_ST, 4, 1)
    FIELD(DMA_INT_ST_CH2, OUT_DONE_CH2_INT_ST, 3, 1)
    FIELD(DMA_INT_ST_CH2, IN_ERR_EOF_CH2_INT_ST, 2, 1)
    FIELD(DMA_INT_ST_CH2, IN_SUC_EOF_CH2_INT_ST, 1, 1)
    FIELD(DMA_INT_ST_CH2, IN_DONE_CH2_INT_ST, 0, 1)

REG32(DMA_INT_ENA_CH2, 0x028)
    FIELD(DMA_INT_ENA_CH2, OUTFIFO_UDF_CH2_INT_ENA, 12, 1)
    FIELD(DMA_INT_ENA_CH2, OUTFIFO_OVF_CH2_INT_ENA, 11, 1)
    FIELD(DMA_INT_ENA_CH2, INFIFO_UDF_CH2_INT_ENA, 10, 1)
    FIELD(DMA_INT_ENA_CH2, INFIFO_OVF_CH2_INT_ENA, 9, 1)
    FIELD(DMA_INT_ENA_CH2, OUT_TOTAL_EOF_CH2_INT_ENA, 8, 1)
    FIELD(DMA_INT_ENA_CH2, IN_DSCR_EMPTY_CH2_INT_ENA, 7, 1)
    FIELD(DMA_INT_ENA_CH2, OUT_DSCR_ERR_CH2_INT_ENA, 6, 1)
    FIELD(DMA_INT_ENA_CH2, IN_DSCR_ERR_CH2_INT_ENA, 5, 1)
    FIELD(DMA_INT_ENA_CH2, OUT_EOF_CH2_INT_ENA, 4, 1)
    FIELD(DMA_INT_ENA_CH2, OUT_DONE_CH2_INT_ENA, 3, 1)
    FIELD(DMA_INT_ENA_CH2, IN_ERR_EOF_CH2_INT_ENA, 2, 1)
    FIELD(DMA_INT_ENA_CH2, IN_SUC_EOF_CH2_INT_ENA, 1, 1)
    FIELD(DMA_INT_ENA_CH2, IN_DONE_CH2_INT_ENA, 0, 1)

REG32(DMA_INT_CLR_CH2, 0x02C)
    FIELD(DMA_INT_CLR_CH2, OUTFIFO_UDF_CH2_INT_CLR, 12, 1)
    FIELD(DMA_INT_CLR_CH2, OUTFIFO_OVF_CH2_INT_CLR, 11, 1)
    FIELD(DMA_INT_CLR_CH2, INFIFO_UDF_CH2_INT_CLR, 10, 1)
    FIELD(DMA_INT_CLR_CH2, INFIFO_OVF_CH2_INT_CLR, 9, 1)
    FIELD(DMA_INT_CLR_CH2, OUT_TOTAL_EOF_CH2_INT_CLR, 8, 1)
    FIELD(DMA_INT_CLR_CH2, IN_DSCR_EMPTY_CH2_INT_CLR, 7, 1)
    FIELD(DMA_INT_CLR_CH2, OUT_DSCR_ERR_CH2_INT_CLR, 6, 1)
    FIELD(DMA_INT_CLR_CH2, IN_DSCR_ERR_CH2_INT_CLR, 5, 1)
    FIELD(DMA_INT_CLR_CH2, OUT_EOF_CH2_INT_CLR, 4, 1)
    FIELD(DMA_INT_CLR_CH2, OUT_DONE_CH2_INT_CLR, 3, 1)
    FIELD(DMA_INT_CLR_CH2, IN_ERR_EOF_CH2_INT_CLR, 2, 1)
    FIELD(DMA_INT_CLR_CH2, IN_SUC_EOF_CH2_INT_CLR, 1, 1)
    FIELD(DMA_INT_CLR_CH2, IN_DONE_CH2_INT_CLR, 0, 1)

REG32(DMA_AHB_TEST, 0x040)
    FIELD(DMA_AHB_TEST, AHB_TESTADDR, 4, 2)
    FIELD(DMA_AHB_TEST, AHB_TESTMODE, 0, 3)

REG32(DMA_MISC_CONF, 0x044)
    FIELD(DMA_MISC_CONF, CLK_EN, 3, 1)
    FIELD(DMA_MISC_CONF, ARB_PRI_DIS, 2, 1)
    FIELD(DMA_MISC_CONF, AHBM_RST_INTER, 0, 1)

REG32(DMA_DATE, 0x048)
    FIELD(DMA_DATE, DATE, 0, 32)

REG32(DMA_IN_CONF0_CH0, 0x070)
    FIELD(DMA_IN_CONF0_CH0, MEM_TRANS_EN_CH0, 4, 1)
    FIELD(DMA_IN_CONF0_CH0, IN_DATA_BURST_EN_CH0, 3, 1)
    FIELD(DMA_IN_CONF0_CH0, INDSCR_BURST_EN_CH0, 2, 1)
    FIELD(DMA_IN_CONF0_CH0, IN_LOOP_TEST_CH0, 1, 1)
    FIELD(DMA_IN_CONF0_CH0, IN_RST_CH0, 0, 1)

