esp32-open-mac/qemu/include/hw/dma/esp32c3_gdma.h
REG32(DMA_IN_CONF1_CH0, 0x074)
    FIELD(DMA_IN_CONF1_CH0, IN_CHECK_OWNER_CH0, 12, 1)

REG32(DMA_INFIFO_STATUS_CH0, 0x078)
    FIELD(DMA_INFIFO_STATUS_CH0, IN_BUF_HUNGRY_CH0, 27, 1)
    FIELD(DMA_INFIFO_STATUS_CH0, IN_REMAIN_UNDER_4B_CH0, 26, 1)
    FIELD(DMA_INFIFO_STATUS_CH0, IN_REMAIN_UNDER_3B_CH0, 25, 1)
    FIELD(DMA_INFIFO_STATUS_CH0, IN_REMAIN_UNDER_2B_CH0, 24, 1)
    FIELD(DMA_INFIFO_STATUS_CH0, IN_REMAIN_UNDER_1B_CH0, 23, 1)
    FIELD(DMA_INFIFO_STATUS_CH0, INFIFO_CNT_CH0, 2, 6)
    FIELD(DMA_INFIFO_STATUS_CH0, INFIFO_EMPTY_CH0, 1, 1)
    FIELD(DMA_INFIFO_STATUS_CH0, INFIFO_FULL_CH0, 0, 1)

REG32(DMA_IN_POP_CH0, 0x07C)
    FIELD(DMA_IN_POP_CH0, INFIFO_POP_CH0, 12, 1)
    FIELD(DMA_IN_POP_CH0, INFIFO_RDATA_CH0, 0, 12)

REG32(DMA_IN_LINK_CH0, 0x080)
    FIELD(DMA_IN_LINK_CH0, INLINK_PARK_CH0, 24, 1)
    FIELD(DMA_IN_LINK_CH0, INLINK_RESTART_CH0, 23, 1)
    FIELD(DMA_IN_LINK_CH0, INLINK_START_CH0, 22, 1)
    FIELD(DMA_IN_LINK_CH0, INLINK_STOP_CH0, 21, 1)
    FIELD(DMA_IN_LINK_CH0, INLINK_AUTO_RET_CH0, 20, 1)
    FIELD(DMA_IN_LINK_CH0, INLINK_ADDR_CH0, 0, 20)

REG32(DMA_IN_STATE_CH0, 0x084)
    FIELD(DMA_IN_STATE_CH0, IN_STATE_CH0, 20, 3)
    FIELD(DMA_IN_STATE_CH0, IN_DSCR_STATE_CH0, 18, 2)
    FIELD(DMA_IN_STATE_CH0, INLINK_DSCR_ADDR_CH0, 0, 18)

REG32(DMA_IN_SUC_EOF_DES_ADDR_CH0, 0x088)
    FIELD(DMA_IN_SUC_EOF_DES_ADDR_CH0, IN_SUC_EOF_DES_ADDR_CH0, 0, 32)

REG32(DMA_IN_ERR_EOF_DES_ADDR_CH0, 0x08C)
    FIELD(DMA_IN_ERR_EOF_DES_ADDR_CH0, IN_ERR_EOF_DES_ADDR_CH0, 0, 32)

REG32(DMA_IN_DSCR_CH0, 0x090)
    FIELD(DMA_IN_DSCR_CH0, INLINK_DSCR_CH0, 0, 32)

REG32(DMA_IN_DSCR_BF0_CH0, 0x094)
    FIELD(DMA_IN_DSCR_BF0_CH0, INLINK_DSCR_BF0_CH0, 0, 32)

REG32(DMA_IN_DSCR_BF1_CH0, 0x098)
    FIELD(DMA_IN_DSCR_BF1_CH0, INLINK_DSCR_BF1_CH0, 0, 32)

REG32(DMA_IN_PRI_CH0, 0x09C)
    FIELD(DMA_IN_PRI_CH0, RX_PRI_CH0, 0, 4)

REG32(DMA_IN_PERI_SEL_CH0, 0x0A0)
    FIELD(DMA_IN_PERI_SEL_CH0, PERI_IN_SEL_CH0, 0, 6)

REG32(DMA_OUT_CONF0_CH0, 0x0D0)
    FIELD(DMA_OUT_CONF0_CH0, OUT_DATA_BURST_EN_CH0, 5, 1)
    FIELD(DMA_OUT_CONF0_CH0, OUTDSCR_BURST_EN_CH0, 4, 1)
    FIELD(DMA_OUT_CONF0_CH0, OUT_EOF_MODE_CH0, 3, 1)
    FIELD(DMA_OUT_CONF0_CH0, OUT_AUTO_WRBACK_CH0, 2, 1)
    FIELD(DMA_OUT_CONF0_CH0, OUT_LOOP_TEST_CH0, 1, 1)
    FIELD(DMA_OUT_CONF0_CH0, OUT_RST_CH0, 0, 1)

REG32(DMA_OUT_CONF1_CH0, 0x0D4)
    FIELD(DMA_OUT_CONF1_CH0, OUT_CHECK_OWNER_CH0, 12, 1)

REG32(DMA_OUTFIFO_STATUS_CH0, 0x0D8)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUT_REMAIN_UNDER_4B_CH0, 26, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUT_REMAIN_UNDER_3B_CH0, 25, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUT_REMAIN_UNDER_2B_CH0, 24, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUT_REMAIN_UNDER_1B_CH0, 23, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUTFIFO_CNT_CH0, 2, 6)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUTFIFO_EMPTY_CH0, 1, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH0, OUTFIFO_FULL_CH0, 0, 1)

REG32(DMA_OUT_PUSH_CH0, 0x0DC)
    FIELD(DMA_OUT_PUSH_CH0, OUTFIFO_PUSH_CH0, 9, 1)
    FIELD(DMA_OUT_PUSH_CH0, OUTFIFO_WDATA_CH0, 0, 9)

REG32(DMA_OUT_LINK_CH0, 0x0E0)
    FIELD(DMA_OUT_LINK_CH0, OUTLINK_PARK_CH0, 23, 1)
    FIELD(DMA_OUT_LINK_CH0, OUTLINK_RESTART_CH0, 22, 1)
    FIELD(DMA_OUT_LINK_CH0, OUTLINK_START_CH0, 21, 1)
    FIELD(DMA_OUT_LINK_CH0, OUTLINK_STOP_CH0, 20, 1)
    FIELD(DMA_OUT_LINK_CH0, OUTLINK_ADDR_CH0, 0, 20)

REG32(DMA_OUT_STATE_CH0, 0x0E4)
    FIELD(DMA_OUT_STATE_CH0, OUT_STATE_CH0, 20, 3)
    FIELD(DMA_OUT_STATE_CH0, OUT_DSCR_STATE_CH0, 18, 2)
    FIELD(DMA_OUT_STATE_CH0, OUTLINK_DSCR_ADDR_CH0, 0, 18)

REG32(DMA_OUT_EOF_DES_ADDR_CH0, 0x0E8)
    FIELD(DMA_OUT_EOF_DES_ADDR_CH0, OUT_EOF_DES_ADDR_CH0, 0, 32)

REG32(DMA_OUT_EOF_BFR_DES_ADDR_CH0, 0x0EC)
    FIELD(DMA_OUT_EOF_BFR_DES_ADDR_CH0, OUT_EOF_BFR_DES_ADDR_CH0, 0, 32)

REG32(DMA_OUT_DSCR_CH0, 0x0F0)
    FIELD(DMA_OUT_DSCR_CH0, OUTLINK_DSCR_CH0, 0, 32)

REG32(DMA_OUT_DSCR_BF0_CH0, 0x0F4)
    FIELD(DMA_OUT_DSCR_BF0_CH0, OUTLINK_DSCR_BF0_CH0, 0, 32)

REG32(DMA_OUT_DSCR_BF1_CH0, 0x0F8)
    FIELD(DMA_OUT_DSCR_BF1_CH0, OUTLINK_DSCR_BF1_CH0, 0, 32)

REG32(DMA_OUT_PRI_CH0, 0x0FC)
    FIELD(DMA_OUT_PRI_CH0, TX_PRI_CH0, 0, 4)

REG32(DMA_OUT_PERI_SEL_CH0, 0x100)
    FIELD(DMA_OUT_PERI_SEL_CH0, PERI_OUT_SEL_CH0, 0, 6)

REG32(DMA_IN_CONF0_CH1, 0x130)
    FIELD(DMA_IN_CONF0_CH1, MEM_TRANS_EN_CH1, 4, 1)
    FIELD(DMA_IN_CONF0_CH1, IN_DATA_BURST_EN_CH1, 3, 1)
    FIELD(DMA_IN_CONF0_CH1, INDSCR_BURST_EN_CH1, 2, 1)
    FIELD(DMA_IN_CONF0_CH1, IN_LOOP_TEST_CH1, 1, 1)
    FIELD(DMA_IN_CONF0_CH1, IN_RST_CH1, 0, 1)

REG32(DMA_IN_CONF1_CH1, 0x134)
    FIELD(DMA_IN_CONF1_CH1, IN_CHECK_OWNER_CH1, 12, 1)

REG32(DMA_INFIFO_STATUS_CH1, 0x138)
    FIELD(DMA_INFIFO_STATUS_CH1, IN_BUF_HUNGRY_CH1, 27, 1)
    FIELD(DMA_INFIFO_STATUS_CH1, IN_REMAIN_UNDER_4B_CH1, 26, 1)
    FIELD(DMA_INFIFO_STATUS_CH1, IN_REMAIN_UNDER_3B_CH1, 25, 1)
    FIELD(DMA_INFIFO_STATUS_CH1, IN_REMAIN_UNDER_2B_CH1, 24, 1)
    FIELD(DMA_INFIFO_STATUS_CH1, IN_REMAIN_UNDER_1B_CH1, 23, 1)
    FIELD(DMA_INFIFO_STATUS_CH1, INFIFO_CNT_CH1, 2, 6)
    FIELD(DMA_INFIFO_STATUS_CH1, INFIFO_EMPTY_CH1, 1, 1)
    FIELD(DMA_INFIFO_STATUS_CH1, INFIFO_FULL_CH1, 0, 1)

REG32(DMA_IN_POP_CH1, 0x13C)
    FIELD(DMA_IN_POP_CH1, INFIFO_POP_CH1, 12, 1)
    FIELD(DMA_IN_POP_CH1, INFIFO_RDATA_CH1, 0, 12)

REG32(DMA_IN_LINK_CH1, 0x140)
    FIELD(DMA_IN_LINK_CH1, INLINK_PARK_CH1, 24, 1)
    FIELD(DMA_IN_LINK_CH1, INLINK_RESTART_CH1, 23, 1)
    FIELD(DMA_IN_LINK_CH1, INLINK_START_CH1, 22, 1)
    FIELD(DMA_IN_LINK_CH1, INLINK_STOP_CH1, 21, 1)
    FIELD(DMA_IN_LINK_CH1, INLINK_AUTO_RET_CH1, 20, 1)
    FIELD(DMA_IN_LINK_CH1, INLINK_ADDR_CH1, 0, 20)

REG32(DMA_IN_STATE_CH1, 0x144)
    FIELD(DMA_IN_STATE_CH1, IN_STATE_CH1, 20, 3)
    FIELD(DMA_IN_STATE_CH1, IN_DSCR_STATE_CH1, 18, 2)
    FIELD(DMA_IN_STATE_CH1, INLINK_DSCR_ADDR_CH1, 0, 18)

REG32(DMA_IN_SUC_EOF_DES_ADDR_CH1, 0x148)
    FIELD(DMA_IN_SUC_EOF_DES_ADDR_CH1, IN_SUC_EOF_DES_ADDR_CH1, 0, 32)

REG32(DMA_IN_ERR_EOF_DES_ADDR_CH1, 0x14C)
    FIELD(DMA_IN_ERR_EOF_DES_ADDR_CH1, IN_ERR_EOF_DES_ADDR_CH1, 0, 32)

REG32(DMA_IN_DSCR_CH1, 0x150)
    FIELD(DMA_IN_DSCR_CH1, INLINK_DSCR_CH1, 0, 32)

REG32(DMA_IN_DSCR_BF0_CH1, 0x154)
    FIELD(DMA_IN_DSCR_BF0_CH1, INLINK_DSCR_BF0_CH1, 0, 32)

REG32(DMA_IN_DSCR_BF1_CH1, 0x158)
    FIELD(DMA_IN_DSCR_BF1_CH1, INLINK_DSCR_BF1_CH1, 0, 32)

