esp32-open-mac/qemu/include/hw/dma/esp32c3_gdma.h
REG32(DMA_IN_PRI_CH1, 0x15C)
    FIELD(DMA_IN_PRI_CH1, RX_PRI_CH1, 0, 4)

REG32(DMA_IN_PERI_SEL_CH1, 0x160)
    FIELD(DMA_IN_PERI_SEL_CH1, PERI_IN_SEL_CH1, 0, 6)

REG32(DMA_OUT_CONF0_CH1, 0x190)
    FIELD(DMA_OUT_CONF0_CH1, OUT_DATA_BURST_EN_CH1, 5, 1)
    FIELD(DMA_OUT_CONF0_CH1, OUTDSCR_BURST_EN_CH1, 4, 1)
    FIELD(DMA_OUT_CONF0_CH1, OUT_EOF_MODE_CH1, 3, 1)
    FIELD(DMA_OUT_CONF0_CH1, OUT_AUTO_WRBACK_CH1, 2, 1)
    FIELD(DMA_OUT_CONF0_CH1, OUT_LOOP_TEST_CH1, 1, 1)
    FIELD(DMA_OUT_CONF0_CH1, OUT_RST_CH1, 0, 1)

REG32(DMA_OUT_CONF1_CH1, 0x194)
    FIELD(DMA_OUT_CONF1_CH1, OUT_CHECK_OWNER_CH1, 12, 1)

REG32(DMA_OUTFIFO_STATUS_CH1, 0x198)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUT_REMAIN_UNDER_4B_CH1, 26, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUT_REMAIN_UNDER_3B_CH1, 25, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUT_REMAIN_UNDER_2B_CH1, 24, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUT_REMAIN_UNDER_1B_CH1, 23, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUTFIFO_CNT_CH1, 2, 6)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUTFIFO_EMPTY_CH1, 1, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH1, OUTFIFO_FULL_CH1, 0, 1)

REG32(DMA_OUT_PUSH_CH1, 0x19C)
    FIELD(DMA_OUT_PUSH_CH1, OUTFIFO_PUSH_CH1, 9, 1)
    FIELD(DMA_OUT_PUSH_CH1, OUTFIFO_WDATA_CH1, 0, 9)

REG32(DMA_OUT_LINK_CH1, 0x1A0)
    FIELD(DMA_OUT_LINK_CH1, OUTLINK_PARK_CH1, 23, 1)
    FIELD(DMA_OUT_LINK_CH1, OUTLINK_RESTART_CH1, 22, 1)
    FIELD(DMA_OUT_LINK_CH1, OUTLINK_START_CH1, 21, 1)
    FIELD(DMA_OUT_LINK_CH1, OUTLINK_STOP_CH1, 20, 1)
    FIELD(DMA_OUT_LINK_CH1, OUTLINK_ADDR_CH1, 0, 20)

REG32(DMA_OUT_STATE_CH1, 0x1A4)
    FIELD(DMA_OUT_STATE_CH1, OUT_STATE_CH1, 20, 3)
    FIELD(DMA_OUT_STATE_CH1, OUT_DSCR_STATE_CH1, 18, 2)
    FIELD(DMA_OUT_STATE_CH1, OUTLINK_DSCR_ADDR_CH1, 0, 18)

REG32(DMA_OUT_EOF_DES_ADDR_CH1, 0x1A8)
    FIELD(DMA_OUT_EOF_DES_ADDR_CH1, OUT_EOF_DES_ADDR_CH1, 0, 32)

REG32(DMA_OUT_EOF_BFR_DES_ADDR_CH1, 0x1AC)
    FIELD(DMA_OUT_EOF_BFR_DES_ADDR_CH1, OUT_EOF_BFR_DES_ADDR_CH1, 0, 32)

REG32(DMA_OUT_DSCR_CH1, 0x1B0)
    FIELD(DMA_OUT_DSCR_CH1, OUTLINK_DSCR_CH1, 0, 32)

REG32(DMA_OUT_DSCR_BF0_CH1, 0x1B4)
    FIELD(DMA_OUT_DSCR_BF0_CH1, OUTLINK_DSCR_BF0_CH1, 0, 32)

REG32(DMA_OUT_DSCR_BF1_CH1, 0x1B8)
    FIELD(DMA_OUT_DSCR_BF1_CH1, OUTLINK_DSCR_BF1_CH1, 0, 32)

REG32(DMA_OUT_PRI_CH1, 0x1BC)
    FIELD(DMA_OUT_PRI_CH1, TX_PRI_CH1, 0, 4)

REG32(DMA_OUT_PERI_SEL_CH1, 0x1C0)
    FIELD(DMA_OUT_PERI_SEL_CH1, PERI_OUT_SEL_CH1, 0, 6)

REG32(DMA_IN_CONF0_CH2, 0x1F0)
    FIELD(DMA_IN_CONF0_CH2, MEM_TRANS_EN_CH2, 4, 1)
    FIELD(DMA_IN_CONF0_CH2, IN_DATA_BURST_EN_CH2, 3, 1)
    FIELD(DMA_IN_CONF0_CH2, INDSCR_BURST_EN_CH2, 2, 1)
    FIELD(DMA_IN_CONF0_CH2, IN_LOOP_TEST_CH2, 1, 1)
    FIELD(DMA_IN_CONF0_CH2, IN_RST_CH2, 0, 1)

REG32(DMA_IN_CONF1_CH2, 0x1F4)
    FIELD(DMA_IN_CONF1_CH2, IN_CHECK_OWNER_CH2, 12, 1)

REG32(DMA_INFIFO_STATUS_CH2, 0x1F8)
    FIELD(DMA_INFIFO_STATUS_CH2, IN_BUF_HUNGRY_CH2, 27, 1)
    FIELD(DMA_INFIFO_STATUS_CH2, IN_REMAIN_UNDER_4B_CH2, 26, 1)
    FIELD(DMA_INFIFO_STATUS_CH2, IN_REMAIN_UNDER_3B_CH2, 25, 1)
    FIELD(DMA_INFIFO_STATUS_CH2, IN_REMAIN_UNDER_2B_CH2, 24, 1)
    FIELD(DMA_INFIFO_STATUS_CH2, IN_REMAIN_UNDER_1B_CH2, 23, 1)
    FIELD(DMA_INFIFO_STATUS_CH2, INFIFO_CNT_CH2, 2, 6)
    FIELD(DMA_INFIFO_STATUS_CH2, INFIFO_EMPTY_CH2, 1, 1)
    FIELD(DMA_INFIFO_STATUS_CH2, INFIFO_FULL_CH2, 0, 1)

REG32(DMA_IN_POP_CH2, 0x1FC)
    FIELD(DMA_IN_POP_CH2, INFIFO_POP_CH2, 12, 1)
    FIELD(DMA_IN_POP_CH2, INFIFO_RDATA_CH2, 0, 12)

REG32(DMA_IN_LINK_CH2, 0x200)
    FIELD(DMA_IN_LINK_CH2, INLINK_PARK_CH2, 24, 1)
    FIELD(DMA_IN_LINK_CH2, INLINK_RESTART_CH2, 23, 1)
    FIELD(DMA_IN_LINK_CH2, INLINK_START_CH2, 22, 1)
    FIELD(DMA_IN_LINK_CH2, INLINK_STOP_CH2, 21, 1)
    FIELD(DMA_IN_LINK_CH2, INLINK_AUTO_RET_CH2, 20, 1)
    FIELD(DMA_IN_LINK_CH2, INLINK_ADDR_CH2, 0, 20)

REG32(DMA_IN_STATE_CH2, 0x204)
    FIELD(DMA_IN_STATE_CH2, IN_STATE_CH2, 20, 3)
    FIELD(DMA_IN_STATE_CH2, IN_DSCR_STATE_CH2, 18, 2)
    FIELD(DMA_IN_STATE_CH2, INLINK_DSCR_ADDR_CH2, 0, 18)

REG32(DMA_IN_SUC_EOF_DES_ADDR_CH2, 0x208)
    FIELD(DMA_IN_SUC_EOF_DES_ADDR_CH2, IN_SUC_EOF_DES_ADDR_CH2, 0, 32)

REG32(DMA_IN_ERR_EOF_DES_ADDR_CH2, 0x20C)
    FIELD(DMA_IN_ERR_EOF_DES_ADDR_CH2, IN_ERR_EOF_DES_ADDR_CH2, 0, 32)

REG32(DMA_IN_DSCR_CH2, 0x210)
    FIELD(DMA_IN_DSCR_CH2, INLINK_DSCR_CH2, 0, 32)

REG32(DMA_IN_DSCR_BF0_CH2, 0x214)
    FIELD(DMA_IN_DSCR_BF0_CH2, INLINK_DSCR_BF0_CH2, 0, 32)

REG32(DMA_IN_DSCR_BF1_CH2, 0x218)
    FIELD(DMA_IN_DSCR_BF1_CH2, INLINK_DSCR_BF1_CH2, 0, 32)

REG32(DMA_IN_PRI_CH2, 0x21C)
    FIELD(DMA_IN_PRI_CH2, RX_PRI_CH2, 0, 4)

REG32(DMA_IN_PERI_SEL_CH2, 0x220)
    FIELD(DMA_IN_PERI_SEL_CH2, PERI_IN_SEL_CH2, 0, 6)

REG32(DMA_OUT_CONF0_CH2, 0x250)
    FIELD(DMA_OUT_CONF0_CH2, OUT_DATA_BURST_EN_CH2, 5, 1)
    FIELD(DMA_OUT_CONF0_CH2, OUTDSCR_BURST_EN_CH2, 4, 1)
    FIELD(DMA_OUT_CONF0_CH2, OUT_EOF_MODE_CH2, 3, 1)
    FIELD(DMA_OUT_CONF0_CH2, OUT_AUTO_WRBACK_CH2, 2, 1)
    FIELD(DMA_OUT_CONF0_CH2, OUT_LOOP_TEST_CH2, 1, 1)
    FIELD(DMA_OUT_CONF0_CH2, OUT_RST_CH2, 0, 1)

REG32(DMA_OUT_CONF1_CH2, 0x254)
    FIELD(DMA_OUT_CONF1_CH2, OUT_CHECK_OWNER_CH2, 12, 1)

REG32(DMA_OUTFIFO_STATUS_CH2, 0x258)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUT_REMAIN_UNDER_4B_CH2, 26, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUT_REMAIN_UNDER_3B_CH2, 25, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUT_REMAIN_UNDER_2B_CH2, 24, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUT_REMAIN_UNDER_1B_CH2, 23, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUTFIFO_CNT_CH2, 2, 6)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUTFIFO_EMPTY_CH2, 1, 1)
    FIELD(DMA_OUTFIFO_STATUS_CH2, OUTFIFO_FULL_CH2, 0, 1)

REG32(DMA_OUT_PUSH_CH2, 0x25C)
    FIELD(DMA_OUT_PUSH_CH2, OUTFIFO_PUSH_CH2, 9, 1)
    FIELD(DMA_OUT_PUSH_CH2, OUTFIFO_WDATA_CH2, 0, 9)

REG32(DMA_OUT_LINK_CH2, 0x260)
    FIELD(DMA_OUT_LINK_CH2, OUTLINK_PARK_CH2, 23, 1)
    FIELD(DMA_OUT_LINK_CH2, OUTLINK_RESTART_CH2, 22, 1)
    FIELD(DMA_OUT_LINK_CH2, OUTLINK_START_CH2, 21, 1)
    FIELD(DMA_OUT_LINK_CH2, OUTLINK_STOP_CH2, 20, 1)
    FIELD(DMA_OUT_LINK_CH2, OUTLINK_ADDR_CH2, 0, 20)

REG32(DMA_OUT_STATE_CH2, 0x264)
    FIELD(DMA_OUT_STATE_CH2, OUT_STATE_CH2, 20, 3)
    FIELD(DMA_OUT_STATE_CH2, OUT_DSCR_STATE_CH2, 18, 2)
    FIELD(DMA_OUT_STATE_CH2, OUTLINK_DSCR_ADDR_CH2, 0, 18)

REG32(DMA_OUT_EOF_DES_ADDR_CH2, 0x268)
    FIELD(DMA_OUT_EOF_DES_ADDR_CH2, OUT_EOF_DES_ADDR_CH2, 0, 32)

REG32(DMA_OUT_EOF_BFR_DES_ADDR_CH2, 0x26C)
    FIELD(DMA_OUT_EOF_BFR_DES_ADDR_CH2, OUT_EOF_BFR_DES_ADDR_CH2, 0, 32)

REG32(DMA_OUT_DSCR_CH2, 0x270)
    FIELD(DMA_OUT_DSCR_CH2, OUTLINK_DSCR_CH2, 0, 32)

REG32(DMA_OUT_DSCR_BF0_CH2, 0x274)
    FIELD(DMA_OUT_DSCR_BF0_CH2, OUTLINK_DSCR_BF0_CH2, 0, 32)

REG32(DMA_OUT_DSCR_BF1_CH2, 0x278)
    FIELD(DMA_OUT_DSCR_BF1_CH2, OUTLINK_DSCR_BF1_CH2, 0, 32)

REG32(DMA_OUT_PRI_CH2, 0x27C)
    FIELD(DMA_OUT_PRI_CH2, TX_PRI_CH2, 0, 4)

REG32(DMA_OUT_PERI_SEL_CH2, 0x280)
    FIELD(DMA_OUT_PERI_SEL_CH2, PERI_OUT_SEL_CH2, 0, 6)
